### Import the necessary libraries

In [1]:
import pandas as pd

### Load user.csv and assign it to a variable called users and use the 'user_id' as index

In [13]:
users = pd.read_csv("user 1.csv",names=['user_id', 'age','gender','occupation','code'],sep='|')
users.set_index('user_id')

         age gender     occupation   code
user_id
1         24      M     technician  85711
2         53      F          other  94043
3         23      M         writer  32067
4         24      M     technician  43537
5         33      F          other  15213
...      ...    ...            ...    ...
939       26      F        student  33319
940       32      M  administrator  02215
941       20      M        student  97229
942       48      F      librarian  78209
943       22      M        student  77841

[943 rows x 4 columns]

In [16]:
# Question 1:
# What are the first 25 entries in the users DataFrame, and what columns are included?
users.head(25).columns

Index(['user_id', 'age', 'gender', 'occupation', 'code'], dtype='object')

In [17]:
# Question 2:
# What are the last 10 entries in the users DataFrame, and what columns are included?
users.tail(10)

     user_id  age gender     occupation   code
933      934   61      M       engineer  22902
934      935   42      M         doctor  66221
935      936   24      M          other  32789
936      937   48      M       educator  98072
937      938   38      F     technician  55038
938      939   26      F        student  33319
939      940   32      M  administrator  02215
940      941   20      M        student  97229
941      942   48      F      librarian  78209
942      943   22      M        student  77841

In [18]:

# Question 3:
# How many observations are there in the users dataset?

users.shape

(943, 5)

In [19]:
# Question 4:
# How many columns are there in the users dataset?
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'code'], dtype='object')

In [20]:

# Question 5:
# What are the names of all the columns in the users dataset?
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'code'], dtype='object')

In [34]:
# Question 6:
# How is the users dataset indexed?
users.index

RangeIndex(start=0, stop=943, step=1)

In [26]:
# Question 7:
# What is the data type of each column in the users dataset?
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
code          object
dtype: object

In [40]:
# Question 8:
# Print only the 'occupation' column from the users dataset.
users[['occupation']]

        occupation
0       technician
1            other
2           writer
3       technician
4            other
..             ...
938        student
939  administrator
940        student
941      librarian
942        student

[943 rows x 1 columns]

In [42]:
# Question 9:
# How many different occupations are present in the users dataset?
users['occupation'].nunique()

21

In [51]:
# Question 10:
# What is the most frequent occupation in the users dataset?
users['occupation'].value_counts().head(1)

student    196
Name: occupation, dtype: int64

In [56]:
# Question 11:
# Summarize the 'age' column in the users dataset.
users['age'].describe()

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64

In [61]:
# Question 12:
# Summarize all the columns in the users dataset.
users.describe(include= 'all')

           user_id         age gender occupation   code
count   943.000000  943.000000    943        943    943
unique         NaN         NaN      2         21    795
top            NaN         NaN      M    student  55414
freq           NaN         NaN    670        196      9
mean    472.000000   34.051962    NaN        NaN    NaN
std     272.364951   12.192740    NaN        NaN    NaN
min       1.000000    7.000000    NaN        NaN    NaN
25%     236.500000   25.000000    NaN        NaN    NaN
50%     472.000000   31.000000    NaN        NaN    NaN
75%     707.500000   43.000000    NaN        NaN    NaN
max     943.000000   73.000000    NaN        NaN    NaN

In [62]:
# Question 13:
# Summarize only the 'occupation' column in the users dataset.
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [63]:
# Question 14:
# What is the mean age of users in the users dataset?
users.age.mean()

34.05196182396607

In [82]:
# Question 15:
# What is the age with the least occurrence in the users dataset?
users['age'].value_counts().tail(5)

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64